# Swin-Transformer-Based YOLOv5s
# Paper: "Swin-Transformer-Based YOLOv5 for Small-Object Detection in Remote Sensing Images"
# Architecture: CSP-Swin Backbone, BiFPN Neck, CoordAtt, 4 Detection Heads (P2-P5)

# Parameters
nc: 12 # number of classes (override with data yaml)
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.50 # layer channel multiple

# CIOU K-means Anchors (Placeholders, regenerate with ciou_kmeans.py)
anchors:
  - [10, 13, 16, 30, 33, 23] # P2/4   - extra small objects
  - [30, 61, 62, 45, 59, 119] # P3/8   - small objects
  - [116, 90, 156, 198, 373, 326] # P4/16  - medium objects
  - [320, 320, 480, 480, 640, 640] # P5/32  - large objects

# YOLOv5 v6.0 backbone modified with C3SWT
backbone:
  # [from, number, module, args]
  [
    [-1, 1, Conv, [64, 6, 2, 2]], # 0-P1/2
    [-1, 1, Conv, [128, 3, 2]], # 1-P2/4
    [-1, 3, C3, [128]], # 2
    [-1, 1, Conv, [256, 3, 2]], # 3-P3/8
    [-1, 6, C3, [256]], # 4
    [-1, 1, Conv, [512, 3, 2]], # 5-P4/16
    [-1, 9, C3, [512]], # 6
    [-1, 1, Conv, [1024, 3, 2]], # 7-P5/32
    [-1, 3, C3SWT, [1024]], # 8 - C3 replaced with C3SWT
    [-1, 1, SPPF, [1024, 5]], # 9
  ]

# Neck with BiFPN fusion and Detection Head
head: [
    # Top-Down Pathway
    [-1, 1, Conv, [512, 1, 1]], # 10
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 11
    [[-1, 6], 1, Concat, [1]], # 12 cat backbone P4
    [-1, 3, C3SWT, [512, False]], # 13 C3SWT replacing C3

    [-1, 1, Conv, [256, 1, 1]], # 14
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 15
    [[-1, 4], 1, Concat, [1]], # 16 cat backbone P3
    [-1, 3, C3SWT, [256, False]], # 17 C3SWT replacing C3

    # Extra P2 scale for small objects
    [-1, 1, Conv, [128, 1, 1]], # 18
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 19
    [[-1, 2], 1, Concat, [1]], # 20 cat backbone P2
    [-1, 3, C3SWT, [128, False]], # 21 P2 out

    # Bottom-Up Pathway (BiFPN weights used inside BiFPNLayer instead of manual fusion here if we wrapped it,
    # but YOLO parser uses manual concat. To use BiFPNLayer we just pass the 4 scales to it)
    # The user brief says to use BiFPNLayer as a module.
    # Let's collect the 4 multi-scale features: [21 (P2), 17 (P3), 13 (P4), 9 (P5)]
    [[21, 17, 13, 9], 1, BiFPNLayer, [256, [128, 256, 512, 1024]]], # 22 BiFPN fusion -> outputs list of 4 tensors

    [-1, 1, CoordAttMulti, [256, 256]], # 23 Applies CA to all 4 tensors

    [-1, 1, Detect, [nc, anchors]], # 24 Detect takes the list of 4
  ]
